## Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

## creating a dataframe from a dictionary

In [3]:
df = pd.DataFrame(d)
# index will be default index values 0,1,2,3,...
# column name would be A,B and C(key name)
# values stored in the list is(key value)

In [5]:
df
# here we can see row 0 has no missing values
# column C has no missing values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## dropna

In [6]:
df.dropna()
# it drops down those rows which has one or more than one null values
# by default action occurs on rows as axis = 0

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis = 1)
# it drop down those columns having one or more than one null values

   C
0  1
1  2
2  3

In [9]:
df.dropna(thresh = 2)
# it drops down those rows which has two null values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [10]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

## filling the mean of  the column

In [11]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64